#ifndef __CONTROL_TASK_H
#define __CONTROL_TASK_H

/* Includes ------------------------------------------------------------------*/
#include "cmsis_os.h"

#endif

// 统一风格：
// 变量小写		—> 全局变量
// 首字母大写	—> 局部变量
// 外部引用的函数，小写。函数定义与声明，首字母大写
// 结构体类型定义，首字母大写
// bool 标志位，cmd 与 define 宏定义——> 全大写

// 注释例子如下：
 
/* Includes ------------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/* Private typedef -----------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Exported variables --------------------------------------------------------*/
/* Private functions ---------------------------------------------------------*/
/* Exported functions --------------------------------------------------------*/

/**
  * @brief
  * @param  
  * @retval 
  */
	
/**
 * @file
 * @author
 * @Version
 * @brief
 * @update
 *
 *
 *
 */

